export default function copyRight() {
    return (
        <div className="secondary_bg shadow_box p-2 text-black">
            <h1 className="text-black text-lg lg:text-2xl lg:col-span-3">سياسة حقوق الملكية والنشر لشبكة "أيقونة"</h1>
            <div className="space-y-2 mt-10">
                <h2 className="font-bold">1. مقدمة وإقرار بالملكية</h2>
                <p>
                    جميع العلامات التجارية، الشعارات، والتصاميم الخاصة بموقع أيقونة هي ملكية فكرية حصرية للموقع ولا يجوز استخدامها أو تقليدها.
                    الموقع يعمل كمنصة لعرض ومشاركة الألعاب، ونحن نحترم بشدة حقوق الملكية الفكرية للمطورين والناشرين الأصليين.
                </p>
                <h2 className="font-bold">2. طبيعة المحتوى (إخلاء مسؤولية)</h2>
                <p>
                    المحتوى الخارجي: معظم الألعاب والبرامج المتاحة للتحميل هي ملك لمطوريها الأصليين. موقع "أيقونة" لا يدعي ملكية هذه الألعاب.
                    الغرض التعليمي والتجريبي: يتم توفير الروابط والمحتوى لأغراض تجريبية أو تعليمية. نحن نشجع المستخدمين دائماً على دعم المطورين عبر شراء النسخ الأصلية من المتاجر الرسمية.
                </p>
                <h2 className="font-bold">3. سياسة "الاستخدام العادل" وDMCA</h2>
                <p>
                    يلتزم موقع أيقونة بقوانين حماية حقوق النشر الرقمية. إذا كنت صاحب حق ملكية وترى أن هناك محتوى ينتهك حقوقك، فنحن نوفر آلية سريعة للتعامل مع ذلك:
                    يجب إرسال إشعار رسمي يتضمن رابط المادة المخالفة وإثبات الملكية.
                    يتعهد موقع "أيقونة" بمراجعة الطلب وإزالة المحتوى المخالف خلال (24-48) ساعة عمل من تاريخ استلام الطلب الصحيح.
                </p>
                <h2 className="font-bold">4. مسؤولية المستخدم</h2>
                <p>
                    يتحمل المستخدم المسؤولية الكاملة عن كيفية استخدام الملفات المحملة من الموقع.
                    يُمنع منعاً باتاً إعادة رفع محتوى موقع "أيقونة" الحصري (مثل الشروحات الخاصة أو المقالات) على منصات أخرى دون ذكر المصدر برابط مباشر.
                </p>
                <h2 className="font-bold">5. الروابط الخارجية</h2>
                <p>
                    قد يحتوي الموقع على روابط تؤدي إلى سيرفرات تحميل خارجية. موقع أيقونة غير مسؤول عن سياسات الخصوصية أو محتوى تلك المواقع الخارجية، وتنتهي مسؤوليتنا بمجرد مغادرتك لنطاقنا.
                </p>
            </div>
        </div>

    )
}